package chapter16_2;

import jp.kwebs.lib.Input;

//正規表現

public class Sample1 {

	public static void main(String[] args) {
		
//		^(?=X).*$ Xを含む文字列の意味
//		^(?!X).*$ Xを含まない文字列の意味
		String reg =
				"^(?=.*\\d)" //if数字を１つ以上含む
//				Javaで文字列で正規表現する際は、\の意味を、
//				エスケープシーケンス\で打ち消さないと、
//				\dの意味にならない。
				+ "(?=.*[a-z])" //if英小文字を１つ以上含む
				+ "(?=.*[A-Z])" //if英大文字１つ以上
				+ "(?=.*[@#$%])" //if記号１つ以上？
//				↑の記号？表現初めて見た教えてほしい。
//				↑で４種類の文字が少なくともそれぞれ１つ以上
//				含まれているという意味になるとのこと。
//				⇒なぜこれで↑の意味になる？
//				X?は０個または１個のXの意味だったと思うけれど、
//				?=だと少し意味が変わる？
				+ ".{6,20}$";
//				↑そのチェックを抜けた文字列が６文字以上２０未満
		String s = Input.getString("パスワード");
		System.out.println(s.matches(reg));
	}

}
